docs/it/ifthenelse.html
<!doctype html>
<html lang="en">
<head>
<title>If Then Else</title>
<!-- 2022-01-21 Fri 12:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Jacopo Costantini">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Dangling Else</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">If Then Else</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Dangling Else</h2>
<div class="outline-text-2" id="text-1">
<p>
Il codice seguente è per noi ambiguo,
a quale dei due <b>if</b> è associato l&rsquo;ultimo else?
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span> = <span style="color: #465953; background-color: #d2ebe3;">10</span>, <span style="color: #4c5361; background-color: #dde4f2;">b</span> = <span style="color: #465953; background-color: #d2ebe3;">20</span>;

    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span> a &lt; <span style="color: #465953; background-color: #d2ebe3;">10</span> <span style="color: #9c739c;">)</span>
    <span style="color: #9c739c;">{</span>
        printf<span style="color: #81895d;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Statement 1\n"</span><span style="color: #81895d;">)</span>;
    <span style="color: #9c739c;">}</span> <span style="color: #614c61; background-color: #f1ddf1;">else</span> <span style="color: #614c61; background-color: #f1ddf1;">if</span> <span style="color: #9c739c;">(</span> b == <span style="color: #465953; background-color: #d2ebe3;">20</span> <span style="color: #9c739c;">){</span>
        printf<span style="color: #81895d;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Statement 2\n"</span><span style="color: #81895d;">)</span>;
    <span style="color: #9c739c;">}</span> <span style="color: #614c61; background-color: #f1ddf1;">else</span> <span style="color: #9c739c;">{</span>
        printf<span style="color: #81895d;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Statement 3\n"</span><span style="color: #81895d;">)</span>;
    <span style="color: #9c739c;">}</span>
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>
</pre>
</div>

<pre class="example">
Statement 2
</pre>


<ol class="org-ol">
<li>Se pensiamo sia associato a <b>if</b> ( a &lt; 10 ) allora il codice dovrebbe visualizzare &ldquo;Statement 3&rdquo;.
</li>
<li>Se invece pensiamo sia associato a <b>if</b> (b == 20) allora il codice dovrebbe visualizzare &ldquo;Statement 2&rdquo;.
</li>
</ol>

<p>
La corretta interpretazione del codice è che il secondo <b>if-else</b> sia lo statement nel
ramo <b>else</b> del primo <b>if</b>, come esplicitato nel codice equivalente qui sotto.
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span> = <span style="color: #465953; background-color: #d2ebe3;">10</span>, <span style="color: #4c5361; background-color: #dde4f2;">b</span> = <span style="color: #465953; background-color: #d2ebe3;">20</span>;

    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>a &lt; <span style="color: #465953; background-color: #d2ebe3;">10</span><span style="color: #9c739c;">)</span>
    <span style="color: #9c739c;">{</span>
        printf<span style="color: #81895d;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Statement 1\n"</span><span style="color: #81895d;">)</span>;
    <span style="color: #9c739c;">}</span> <span style="color: #614c61; background-color: #f1ddf1;">else</span> <span style="color: #9c739c;">{</span>
        <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #81895d;">(</span>b == <span style="color: #465953; background-color: #d2ebe3;">20</span><span style="color: #81895d;">)</span>
        <span style="color: #81895d;">{</span>
            printf<span style="color: #957f5f;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Statement 2\n"</span><span style="color: #957f5f;">)</span>;
        <span style="color: #81895d;">}</span> <span style="color: #614c61; background-color: #f1ddf1;">else</span> <span style="color: #81895d;">{</span>
            printf<span style="color: #957f5f;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Statement 3\n"</span><span style="color: #957f5f;">)</span>;
        <span style="color: #81895d;">}</span>
    <span style="color: #9c739c;">}</span>
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>
</pre>
</div>


<p>
<a href="#sec-1">[ TOP ]​</a>  <a href="ITlist.html">[ HOME ]​</a>
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Jacopo Costantini</p>
<p class="date">Created: 2022-01-21 Fri 12:44</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
